In [6]:
import pandas as pd
from IPython.display import display

In [7]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [8]:
display (df1)
display (df2)
display (df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [9]:
# Utilizando merge y joins obtener un dataframe como resultado de los tres anteriores 
df4 = pd.merge(df1,df2)
df5 = pd.merge(df3, df4)
df5

         group supervisor employee  hire_date
0   Accounting      Carly      Bob       2008
1  Engineering      Guido     Jake       2012
2  Engineering      Guido     Lisa       2004
3           HR      Steve      Sue       2014

In [10]:
# Generar un nuevo dataframe que contenga el resultado de los tres anteriores y df4
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']})

display(df4)

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [11]:
# Utilizar el método drop() para eliminar las columnas redudantes
df6 = pd.merge(df5,df4,  left_on="employee", right_on="applier")
df6 = df6.drop(['applier'], axis=1)
df6

         group supervisor employee  hire_date          position
0   Accounting      Carly      Bob       2008               CTO
1  Engineering      Guido     Jake       2012  Senior Developer
2  Engineering      Guido     Lisa       2004               CFO
3           HR      Steve      Sue       2014        Head of HR

In [15]:
df1 = pd.DataFrame({"a":[1],"b":[2],"c":[3]})
df2 = pd.DataFrame({"a":[1,4],"b":[7,9],"c":[8,9]})
# Utilizando los DataFrames anteriores realizar un inner, outer, left y right merges entre ellos usando la columna 'a'.
# Antes de ejecutar cada join escribir un comentario con el output esperado.

In [16]:
display(df1)
display(df2)

   a  b  c
0  1  2  3

   a  b  c
0  1  7  8
1  4  9  9

In [17]:
#los que coincidan
pd.merge(df1,df2,on="a",how="inner", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1      2      3      7      8

In [18]:
#los de df1 y nan en los que no estene en df2
pd.merge(df1,df2,on="a",how="left", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1      2      3      7      8

In [19]:
#al contrario que el anterior
pd.merge(df1,df2,on="a",how="right", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1    2.0    3.0      7      8
1  4    NaN    NaN      9      9

In [20]:
#todos contra todosd
pd.merge(df1,df2,on="a",how="outer", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1    2.0    3.0      7      8
1  4    NaN    NaN      9      9